In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
df= pd.read_csv("e-statement.csv")
df.head()

,Date,Transaction Detail,Opening Balance,Incoming,Outgoing,Closing Balance
0,"Nov 22, 2024",Money Transfer - NADEEM AHMED - 03135010665 th...,"21,009.09",-,(30.00),"20,979.09"
1,"Nov 22, 2024",Money Transfer - NADEEM AHMED - 03135010665 th...,"21,039.09",-,(30.00),"21,009.09"
2,"Nov 21, 2024",Money Transfer - NADEEM AHMED - 03135010665 th...,"21,069.09",-,(30.00),"21,039.09"
3,"Nov 21, 2024",Money Transfer - NADEEM AHMED - 03135010665 th...,"21,099.09",-,(30.00),"21,069.09"
4,"Nov 21, 2024",Money Transfer - NADEEM AHMED - 03135010665 th...,"21,129.09",-,(30.00),"21,099.09"

In [8]:
df.drop(["Transaction Detail", "Opening Balance" ,"Incoming"],axis= 1, inplace=True)

In [9]:
df["Date"].dtype

dtype('O')

In [13]:
df["Date"] = pd.to_datetime(df["Date"])

In [15]:
df.tail(15)

          Date    Outgoing Closing Balance
123 2024-09-11           -        7,410.39
124 2024-09-11  (1,400.00)        7,110.39
125 2024-09-10           -        8,510.39
126 2024-09-08    (450.00)        8,010.39
127 2024-09-08           -        8,460.39
128 2024-09-05    (100.00)        8,010.39
129 2024-09-05           -        8,110.39
130 2024-09-05    (500.00)        6,110.39
131 2024-08-31    (750.86)        6,610.39
132 2024-08-30    (500.00)        7,361.39
133 2024-08-29           -        7,861.39
134 2024-08-26    (436.70)        7,361.39
135 2024-08-26    (484.70)        7,798.09
136 2024-08-26           -        8,282.79
137 2024-08-24  (3,000.00)        5,300.19

In [ ]:
df['Outgoing'] = df['Outgoing'].str.replace(r'[()]', '', regex=True)#.astype(float)
df['Outgoing'] = df['Outgoing'].str.replace(r'[-]', '0', regex=True)#.astype(float)

In [26]:
df["Outgoing"].tail(20)

118           0
119      200.00
120           0
121           0
122      400.00
123           0
124    1,400.00
125           0
126      450.00
127           0
128      100.00
129           0
130      500.00
131      750.86
132      500.00
133           0
134      436.70
135      484.70
136           0
137    3,000.00
Name: Outgoing, dtype: object